//--jsTask2

/* --задача № 1 возрастные группы

let age = +prompt(`Введите свой возраст`);
if (age<=0){
    alert(`Вы ввели недопустимое значение для возраста`);
} else if (age<=12) {
    alert(`Вы еще ребенок`);
} else if (age > 12 && age <= 18) {
    alert(`Вы подросток`);
} else if (age > 18 && age <= 60) {
    alert(`Вы уже взрослый человек`);
} else if (age > 60 && age <= 100) {
    alert(`Вы наверно пенсионер`)
} else {
    alert(`Вы ввели недопустимое значение для возраста`)
}

/*--задача № 2 спецсимвол по цифре

let a = +prompt(`Введите цифру от 0 до 9`);
switch (a) {
    case 0:
        alert(`0-)`);
    break;
    case 1:
        alert(`1-!`);
    break;
    case 2:
        alert(`2-@`);
    break;
    case 3:
        alert(`3-#`);
    break;
    case 4:
        alert(`4-$`);
    break;
    case 5:
        alert(`5-%`);
    break;
    case 6:
        alert(`6-^`);
    break;
    case 7:
        alert(`7-&`);
    break;
    case 8:
        alert(`8-*`);
    break;
    case 9:
        alert(`9-(`);
    break;
    default:
        alert(`Нет такого значения`)
}

/*--задача № 3 проверка одинаковых цифр

let a = +prompt(`Введите трехзначное число`);
let a1 = Math.trunc (a/100);    // первая цифра
let a2 = Math.trunc (a%100/10); // вторая цифра
let a3 = a%10;                  // третья цифра         
let result = (a1 == a2 || a1 == a3 || a2 == a3) ? //сравним друг с другом
alert(`В числе есть одинаковые цифры`) :
alert(`В числе нет одинаковых цифр`);



/*--задача № 4 прверка високосного года

let a = +prompt(`Введите год YYYY`);
let result = (a%400 === 0 || a%4 === 0 && a%100 != 0) ? // проверка кратности
alert(`${a}/400=${a%400} или ${a}/4=${a%4} и не кратен ${a}/100=${a%100} -Год високосный`) :
alert(`${a}/400=${a%400} или ${a}/4=${a%4} и кратен ${a}/100=${a%100} -Год не високосный`);


/*--задача № 5 проверка числа на полиндром

let a = +prompt(`Введите пятизначное число`);
let a1 = Math.trunc (a/10000);    // первая цифра
let a2 = Math.trunc (a%10000/1000);  // вторая цифра
let a4 = Math.trunc (a%100/10);   // четвертая цифра
let a5 = a%10;                    // пятая цифра   
let result = (a1 == a5 && a2 == a4) ? //сравние 1 с 5 и 2 с 4
alert(`${a1} ${a2} = ${a4} ${a5} это число полиндром`) :
alert(`${a1} ${a2} не = ${a4} ${a5} это число не полиндром`);

/*--задача № 6 конвертер валют

let a = +prompt(`Введите сумму USD`)
let val = prompt(`Введите валюту в которую нужно перевести EUR, UAN или AZN`)
switch (val) {
    case `EUR`:
        alert(`${a}USD = ${a*0.8418}EUR`);
    break;
    case `UAN`:
        alert(`${a}USD = ${a*26.8242}UAN`);
    break;
    case `AZN`:
        alert(`${a}USD = ${a*1.7}AZN`);
    default:
        alert(`Введено неверное значение валюты`)
}

/*--задача № 7 конвертер валют--*/







